# CLI Tools
brew "ast-grep"              # Structural code search using AST patterns
brew "awscli"                # AWS command-line interface
brew "bat"                   # Cat clone with syntax highlighting
brew "chafa"                 # Terminal image viewer
brew "coreutils"             # GNU core utilities (gls, gcp, etc.)
brew "difftastic"            # Structural/syntax-aware diffs
brew "direnv"                # Directory-specific environment variables
brew "exiftool"              # Read/write image metadata
brew "exiv2"                 # Image metadata library and tools
brew "eza"                   # Modern ls replacement
brew "fd"                    # Fast find alternative
brew "fzf"                   # Fuzzy finder
brew "gh"                    # GitHub CLI
brew "gifsicle"              # GIF manipulation tool
brew "git-delta"             # Better git diff viewer
brew "go"                    # Golang
brew "golangci-lint"         # Golang linter
brew "helix"                 # Modal text editor
brew "httpie"                # Intuitive HTTP client
brew "htop"                  # Interactive process viewer
brew "hurl"                  # HTTP request testing tool
brew "hyperfine"             # Command benchmarking
brew "imagemagick"           # Image manipulation suite
brew "jpegoptim"             # JPEG optimization
brew "jq"                    # JSON processor
brew "mas"                   # Mac App Store CLI
brew "midnight-commander"    # Terminal file manager
brew "mise"                  # Polyglot runtime manager
brew "ncdu"                  # Disk usage analyzer
brew "nnn"                   # Terminal file manager
brew "optipng"               # PNG optimization
brew "pngquant"              # PNG compression
brew "pwgen"                 # Password generator
brew "ripgrep"               # Fast code search (rg)
brew "scc"                   # Code statistics tool
brew "semgrep"               # Semantic code analysis
brew "starship"              # Cross-shell prompt
brew "svgo"                  # SVG optimizer
brew "the_silver_searcher"   # Code search (ag)
brew "tldr"                  # Simplified man pages
brew "tmux"                  # Terminal multiplexer
brew "tokei"                 # Code statistics
brew "tree"                  # Directory tree visualization
brew "universal-ctags"       # Symbol indexing
brew "watchexec"             # Run commands on file changes
brew "websocat"              # WebSocket CLI client
brew "yq"                    # YAML/TOML processor
brew "zoxide"                # Smarter cd command

# macOS Apps
cask "caffeine"              # Prevent display sleep
cask "claude-code"           # Anthropic's Claude CLI
cask "omnidisksweeper"       # Disk space analyzer
cask "pearcleaner"           # App uninstaller
cask "vanilla"               # Menu bar icon manager
cask "visual-studio-code"    # Open-source code editor
